# How read files in Pandas?

In [1]:
# ! pip install pandas
import pandas as pd

In [2]:
df =pd.read_table('http://bit.ly/chiporders')

In [3]:
df1 = pd.read_table('Data/chipotle.tsv') # we save it in df1 objects

In [4]:
df1.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [5]:
col_name = ['user_id', 'age', 'gender', 'occupation', 'zip_code']
df2 = pd.read_table('Data/movieusers.tsv', sep='|', header=None, names= col_name)

In [6]:
df2.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

# How do I select pandas Series from a DataFrame?

In [7]:
ufo = pd.read_csv('Data/ufo.csv')

In [8]:
type(ufo)

pandas.core.frame.DataFrame

In [9]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [10]:
type(ufo['City'])

pandas.core.series.Series

In [11]:
ufo.City

0                      Ithaca
1                 Willingboro
2                     Holyoke
3                     Abilene
4        New York Worlds Fair
                 ...
18236              Grant Park
18237             Spirit Lake
18238             Eagle River
18239             Eagle River
18240                    Ybor
Name: City, Length: 18241, dtype: object

# Why do some pandas commands end with parentheses and other commands don't?

In [12]:
movies = pd.read_csv('http://bit.ly/imdbratings')

In [19]:
movies.to_csv('./Data/movies_imdbratings.csv') # save files in local machine

In [21]:
movies.head()

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."

In [22]:
movies.describe()

       star_rating    duration
count   979.000000  979.000000
mean      7.889785  120.979571
std       0.336069   26.218010
min       7.400000   64.000000
25%       7.600000  102.000000
50%       7.800000  117.000000
75%       8.100000  134.000000
max       9.300000  242.000000

In [29]:
movies.describe(include=['object']) # it's describe all the column with string data types

,title,content_rating,genre,actors_list
count,979,976,979,979
unique,975,12,16,969
top,Dracula,R,Drama,"[u'Daniel Radcliffe', u'Emma Watson', u'Rupert..."
freq,2,460,278,6

In [23]:
movies.shape

(979, 6)

In [24]:
movies.dtypes

star_rating       float64
title              object
content_rating     object
genre              object
duration            int64
actors_list        object
dtype: object

In [25]:
type(movies)

pandas.core.frame.DataFrame

## as we see movies is a DataFrame object.
## so as like other object it's also have methods (which are fowlled by parenthesis) and attributes.

In [28]:
movies.

0                             The Shawshank Redemption
1                                        The Godfather
2                               The Godfather: Part II
3                                      The Dark Knight
4                                         Pulp Fiction
                            ...
974                                            Tootsie
975                        Back to the Future Part III
976    Master and Commander: The Far Side of the World
977                                        Poltergeist
978                                        Wall Street
Name: title, Length: 979, dtype: object

# How do i rename columns in a pandas DataFrame?

In [31]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [32]:
ufo.columns

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Time'], dtype='object')

In [35]:
# method 1
ufo.rename(columns={'Colors Reported': 'Colors_Reported', 'Shape Reported': 'Shape_Reported'})

,City,Colors_Reported,Shape_Reported,State,Time
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00
3,Abilene,NaN,DISK,KS,6/1/1931 13:00
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00
...,...,...,...,...,...
18236,Grant Park,NaN,TRIANGLE,IL,12/31/2000 23:00
18237,Spirit Lake,NaN,DISK,IA,12/31/2000 23:00
18238,Eagle River,NaN,NaN,WI,12/31/2000 23:45
18239,Eagle River,RED,LIGHT,WI,12/31/2000 23:45
18240,Ybor,NaN,OVAL,FL,12/31/2000 23:59

# Using the rename method we can change one or more specific columns at a time, But it's time consuming when we want to change the whole columns name of a Dataframe at a time.

In [38]:
# method 2
ufo_cols = ['city', 'color_report', 'shape_report', 'state', 'time']
ufo.columns = ufo_cols

In [37]:
ufo.head()

                   city color_report shape_report state             time
0                Ithaca          NaN     TRIANGLE    NY   6/1/1930 22:00
1           Willingboro          NaN        OTHER    NJ  6/30/1930 20:00
2               Holyoke          NaN         OVAL    CO  2/15/1931 14:00
3               Abilene          NaN         DISK    KS   6/1/1931 13:00
4  New York Worlds Fair          NaN        LIGHT    NY  4/18/1933 19:00

In [40]:
ufo.columns

Index(['city', 'color_report', 'shape_report', 'state', 'time'], dtype='object')

# method 3

In [41]:
ufo = pd.read_csv('Data/ufo.csv')

In [42]:
ufo.columns

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Time'], dtype='object')

In [43]:
ufo.columns = ufo.columns.str.replace(' ', '_' )

In [44]:
ufo.columns

Index(['City', 'Colors_Reported', 'Shape_Reported', 'State', 'Time'], dtype='object')